package main

//删除切片元素

func main() {
	/** ----------------从开头删除--------------------------------------*/
	// 直接移动数据指针
	a := []int{1, 2, 3}
	a = a[1:] //删除开头1个元素
	a = a[2:] //删除开头2个元素

	//不移动指针用append来实现
	a = []int{1, 2, 3}
	a = append(a[:0], a[1:]...) // 删除开头1个元素
	a = append(a[:0], a[2:]...) // 删除开头N个元素

	//不移动指针用copy来实现
	a = []int{1, 2, 3}
	a = a[:copy(a, a[1:])] // 删除开头1个元素
	a = a[:copy(a, a[2:])] // 删除开头N个元素

	/** -----------------------从中间位置删除-------------------------------*/
	a = []int{1, 2, 3, 4, 5, 6, 7}
	a = append(a[:2], a[2+2:]...)  // 删除中间N个元素
	a = a[:2+copy(a[2:], a[2+1:])] // 删除中间1个元素
	a = a[:2+copy(a[2:], a[2+3:])] // 删除中间N个元素


	/** -----------------------从尾部位置删除-------------------------------*/
	a = []int{1, 2, 3}
	a = a[:len(a)-1] // 删除尾部1个元素
	a = a[:len(a)-2] // 删除尾部N个元素
}
